# Tooling required to bootstrap yay when it is missing.
base-devel
git

# Core desktop integration used directly by this repo.
adwaita-cursors
hyprland
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
fish
foot
fuzzel
gnome-keyring
polkit-gnome
kitty
kitty-shell-integration
kitty-terminfo
starship
uwsm
ydotool

# Font coverage for CJK, emoji, and fallback glyphs.
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra

# Small user-facing tools referenced by keybinds or the shell.
btop
cliphist
fastfetch
gammastep
hyprpicker
jq
libqalculate
mpv
nemo
pavucontrol-qt
qps
thunar
trash-cli
wl-clipboard
